app/views/carts/edit.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 71], ["LIMIT", 1]]
---
	<br><br>
	User : <%= User.find(current_user.id).email %>