app/views/carts/index.html.erb

SELECT "items".* FROM "items" INNER JOIN "carts_items" ON "items"."id" = "carts_items"."item_id" WHERE "carts_items"."cart_id" = ?  [["cart_id", 6]]
---
	<h2>VOS ITEMS :</h2>
	<% @cart.items.each do |item| %>