app/views/carts/show.html.erb

					<th scope="row"><%= i+1 %></th>
					<td><%= Item.find(item.item_id).title %></td>
					<td><%= Item.find(item.item_id).price %> </td>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]