app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2018-08-29 07:10:43.360226"], ["updated_at", "2018-08-29 07:10:43.360226"], ["user_id", 4]]
---
  def show
    if user_signed_in?
      @id_user = current_user.id
      mon_cart = Cart.create(user_id: @id_user)