app/controllers/carts_controller.rb

  def edit
    @id_item_to_del = params[:id_item_to_del]

    @num_cart_user = Cart.find_by(user_id: current_user.id).id
    @tab = Store.where(cart_id: @num_cart_user)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 12], ["LIMIT", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."cart_id" = ?  [["cart_id", 71]]

  def show
    if user_signed_in?
      @id_user = current_user.id
      @cart_id = Cart.find_by(user_id: @id_user).id

    	@name_user = current_user.email
      num_cart = Cart.find_by(user_id: @id_user)
      @cart = Store.where(cart_id: num_cart.id)

      @prix_total_panier_float = 0.0
      @item_prix_float = 0.0
      @cart.each do |i|
        @item_prix_float = Item.find(i.item_id).price.to_i+ "0.#{Item.find(i.item_id).price.split(",")[1]}".to_f
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 4], ["LIMIT", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."cart_id" = ?  [["cart_id", 71]]
SELECT "items".* FROM "items" INNER JOIN "carts_items" ON "items"."id" = "carts_items"."item_id" WHERE "carts_items"."cart_id" = ?  [["cart_id", 1]]